gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_flow/Hardware/NET/net_mqttsn_message_operate.c
/**
  *********************************************************************************************************
  * @file    net_mqttsn_message_operate.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2018-03-02
  * @brief   
  *********************************************************************************************************
  * @attention
  *
  *
  *
  *********************************************************************************************************
  */

#include "net_mqttsn_message_operate.h"
#include "inspectmessageoperate.h"
#include "platform_config.h"
#include "platform_map.h"
#include "stm32l1xx_config.h"
#include "hal_rtc.h"
#include "radar_api.h"
#include "tmesh_algorithm.h"
#include "string.h"

#if MQTTSN_MSG_VERSION_STREAM_TYPE == MQTTSN_MSG_VERSION_JSON_STREAM

MQTTSN_SwapStatusBasicTypeDef		NETMqttSNMessageParkStatusBasic;
MQTTSN_SwapStatusExtendTypeDef	NETMqttSNMessageParkStatusExtend;
MQTTSN_SwapInfoWorkTypeDef		NETMqttSNMessageParkInfoWork;
MQTTSN_SwapInfoBasicTypeDef		NETMqttSNMessageParkInfoBasic;
MQTTSN_SwapInfoDynamicTypeDef		NETMqttSNMessageParkInfoDynamic;
MQTTSN_SwapInfoResponseTypeDef	NETMqttSNMessageParkInfoResponse;

#endif

#if MQTTSN_MSG_VERSION_STREAM_TYPE == MQTTSN_MSG_VERSION_BYTE_STREAM

MQTTSN_SwapSendDataTypeDef		NETMqttSNMessageSendPark;

#endif

#if MQTTSN_MSG_VERSION_STREAM_TYPE == MQTTSN_MSG_VERSION_JSON_STREAM

/**********************************************************************************************************
 @Function			int NET_Message_Operate_Creat_Json_MoteStatus_Basic(char* outBuffer)
 @Description			NET_Message_Operate_Creat_Json_MoteStatus_Basic
 @Input				outBuffer
 @Return				Length
 @attention			!!<<< MaxLength 512Byte >>>!!
**********************************************************************************************************/
int NET_Message_Operate_Creat_Json_MoteStatus_Basic(char* outBuffer)
{
	MQTTSN_StatusBasicTypeDef dataBuf;
	struct tm datatime;
	
	if (NET_MqttSN_Message_StatusBasicDequeue(&dataBuf) != true) {
		return 0;
	}
	
	datatime = RTC_ConvUnixToCalendar(dataBuf.DateTime + 8 * 3600);
	
	sprintf(outBuffer, 
		"{"
			"\"SN\":\"%08x\","
			"\"Name\":\"TMoteStatus\","
			"\"TMoteStatus\":"
			"{"
				"\"Status\":%d,"
				"\"Count\":%d,"
				"\"Time\":\"20%02d-%02d-%02d %02d:%02d:%02d\""
			"}"
		"}",
		
		dataBuf.DeviceSN,
		dataBuf.Status,
		dataBuf.Count,
		datatime.tm_year, datatime.tm_mon, datatime.tm_mday,
		datatime.tm_hour, datatime.tm_min, datatime.tm_sec
	);
	
	return strlen(outBuffer);
}

/**********************************************************************************************************
 @Function			int NET_Message_Operate_Creat_Json_MoteStatus_Extend(char* outBuffer)
 @Description			NET_Message_Operate_Creat_Json_MoteStatus_Extend
 @Input				outBuffer
 @Return				Length
 @attention			!!<<< MaxLength 512Byte >>>!!
**********************************************************************************************************/
int NET_Message_Operate_Creat_Json_MoteStatus_Extend(char* outBuffer)
{
	MQTTSN_StatusExtendTypeDef dataBuf;
	struct tm datatime;
	
	if (NET_MqttSN_Message_StatusExtendDequeue(&dataBuf) != true) {
		return 0;
	}
	
	datatime = RTC_ConvUnixToCalendar(dataBuf.DateTime + 8 * 3600);
	
	sprintf(outBuffer, 
		"{"
			"\"SN\":\"%08x\","
			"\"Name\":\"TMoteStatus\","
			"\"TMoteStatus\":"
			"{"
				"\"Status\":%d,"
				"\"Count\":%d,"
				"\"Time\":\"20%02d-%02d-%02d %02d:%02d:%02d\","
				"\"x\":%d,"
				"\"y\":%d,"
				"\"z\":%d,"
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
				"\"xBack\":%d,"
				"\"yBack\":%d,"
				"\"zBack\":%d,"
#endif
				"\"MagDiff\":%d,"
				"\"Distance\":%d,"
				"\"Strength\":%d,"
				"\"CoverCount\":%d,"
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V1
				"\"RadarDiff\":%d"
#elif MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
				"\"RadarDiff\":%d,"
				"\"RadarVal\":\"%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d\","
				"\"RadarBack\":\"%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d\","
				"\"Rssi\":%d,"
				"\"Snr\":%d,"
				"\"TempCore\":%d,"
				"\"TempQmc\":%d,"
				"\"DebugVal\":%d"
#endif
			"}"
		"}",
		
		dataBuf.DeviceSN,
		dataBuf.Status,
		dataBuf.Count,
		datatime.tm_year, datatime.tm_mon, datatime.tm_mday,
		datatime.tm_hour, datatime.tm_min, datatime.tm_sec,
		dataBuf.MagX,
		dataBuf.MagY,
		dataBuf.MagZ,
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
		dataBuf.MagneticBackX,
		dataBuf.MagneticBackY,
		dataBuf.MagneticBackZ,
#endif
		dataBuf.MagDiff,
		dataBuf.Distance,
		dataBuf.Strength,
		dataBuf.CoverCount,
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V1
		dataBuf.RadarDiff
#elif MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
		dataBuf.RadarDiff,
		dataBuf.Radarval[0], dataBuf.Radarval[1], dataBuf.Radarval[2], dataBuf.Radarval[3],
		dataBuf.Radarval[4], dataBuf.Radarval[5], dataBuf.Radarval[6], dataBuf.Radarval[7],
		dataBuf.Radarval[8], dataBuf.Radarval[9], dataBuf.Radarval[10],dataBuf.Radarval[11],
		dataBuf.Radarval[12],dataBuf.Radarval[13],dataBuf.Radarval[14],dataBuf.Radarval[15],
		dataBuf.Radarback[0], dataBuf.Radarback[1], dataBuf.Radarback[2], dataBuf.Radarback[3],
		dataBuf.Radarback[4], dataBuf.Radarback[5], dataBuf.Radarback[6], dataBuf.Radarback[7],
		dataBuf.Radarback[8], dataBuf.Radarback[9], dataBuf.Radarback[10],dataBuf.Radarback[11],
		dataBuf.Radarback[12],dataBuf.Radarback[13],dataBuf.Radarback[14],dataBuf.Radarback[15],
		dataBuf.NBRssi,
		dataBuf.NBSnr,
		dataBuf.MCUTemp,
		dataBuf.QMCTemp,
		dataBuf.Debugval
#endif
	);
	
	return strlen(outBuffer);
}

/**********************************************************************************************************
 @Function			int NET_Message_Operate_Creat_Json_MoteInfo_Work(char* outBuffer)
 @Description			NET_Message_Operate_Creat_Json_MoteInfo_Work
 @Input				outBuffer
 @Return				Length
 @attention			!!<<< MaxLength 512Byte >>>!!
**********************************************************************************************************/
int NET_Message_Operate_Creat_Json_MoteInfo_Work(char* outBuffer)
{
	MQTTSN_InfoWorkTypeDef dataBuf;
	
	if (NET_MqttSN_Message_InfoWorkDequeue(&dataBuf) != true) {
		return 0;
	}
	
